In [48]:
import sqlite3

conn = sqlite3.connect("sample9.db")

curr = conn.cursor()

com1 = '''CREATE TABLE IF NOT EXISTS 
            student(prn INTEGER, name TEXT, grade TEXT)'''

curr.execute(com1)

com2 = "INSERT INTO student VALUES('1','Ram','A')"
curr.execute(com2)

conn.commit()

query = "SELECT * FROM student"
curr.execute(query)
row = curr.fetchall()

for rows in row:
    print(rows)

(1, 'Ram', 'A')

In [49]:
import pandas as pd
# conn = sqlite3.connect("sample10.db")
query = "SELECT * FROM student"

data = [('2','Shyam','B'),('3','Ganesh','B'),('4','Ishwar','B'),('5','Fulchand','C')]

com = "INSERT INTO student VALUES(?,?,?)"
curr.executemany(com,data)
conn.commit()

df = pd.read_sql_query(query,conn)

conn.close()

df.head()

   prn      name grade
0    1       Ram     A
1    2     Shyam     B
2    3    Ganesh     B
3    4    Ishwar     B
4    5  Fulchand     C

In [50]:
df['name']

0         Ram
1       Shyam
2      Ganesh
3      Ishwar
4    Fulchand
Name: name, dtype: object

In [52]:
df.set_index('prn')

         name grade
prn
1         Ram     A
2       Shyam     B
3      Ganesh     B
4      Ishwar     B
5    Fulchand     C

In [59]:
mid_students = df[df['grade'] == 'B']
mid_students.head()

   prn    name grade
1    2   Shyam     B
2    3  Ganesh     B
3    4  Ishwar     B

In [60]:
df.iloc[2,:]

prn           3
name     Ganesh
grade         B
Name: 2, dtype: object